app/controllers/equipment_controller.rb

SELECT `equipment`.* FROM `equipment`
---
	def index
		@equipment = Equipment.all

SELECT `equipment`.* FROM `equipment`
---
	def show
		@equipment = Equipment.all

INSERT INTO `equipment` (`name`, `equipment_type`, `serial_no`, `employee`, `status`, `created_at`, `updated_at`) VALUES ('asdf', 'asdf', 'asfd', 'asdf', 'asdf', '2016-08-18 07:24:53', '2016-08-18 07:24:53')
---
	def create
		@equipment = Equipment.create(equipment_params)

SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 12 LIMIT 1
---
	def edit
		@equipment = Equipment.find(params[:id])

UPDATE `equipment` SET `employee` = 'Maresa', `updated_at` = '2016-08-17 11:22:45' WHERE `equipment`.`id` = 24
---
	def update
    respond_to do |format|
      if @equipment.update(equipment_params)

DELETE FROM `equipment` WHERE `equipment`.`id` = 1
---
	def destroy
		@equipment.destroy